src/InformationRegisters/ar_Запуски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_Запуски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_СтатусЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтветLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АгентРеф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтартовалВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершенВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Триггер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПользовательРеф</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВыход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтоимостьРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ШаговВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РодительскийИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_StateSnapshot</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнийПульс</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПрофильЗапуска</Name>
					<Comment>Профиль запуска (CONS-01), определивший ответственного и область данных этого запуска. Пустая ссылка — профиль не указан (обратная совместимость, CONS-02).</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_ПрофилиЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПопытокВозобновления</Name>
					<Comment>Счётчик повторов техсбоя (§3.5) и предохранитель третьего слоя детекции прогресса — потолок 10 продолжений (§3.3, CONS-11). Заполняется ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПродолженийСделано</Name>
					<Comment>CONS-11: счётчик фактических продолжений цикла по вердикту Продолжить надзора (§3.3) — предохранитель слоя 3, потолок 10. НЕ путать с ar_ПопытокВозобновления (CONS-09, счётчик техповторов, потолок 3) — разные счётчики по решению аналитика/оркестратора, во избежание рассинхрона двух независимых механизмов. Не сбрасывается при автовозобновлении техсбоя (ar_Планировщик.ОбработатьАвтовозобновление).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнееРешениеНадзора</Name>
					<Comment>Каноническое имя значения ar_ВердиктНадзора (или пусто, если надзор ещё не вызывался) — хранится строкой, а не ссылкой на перечисление, чтобы консоль показывала решение без join (план §5.1). Заполняется ar_Надзор (CONS-10).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтпечатокШага</Name>
					<Comment>Хэш «имя tool + хэш аргументов + хэш результата» последнего шага — основа result-aware детекции застревания (§3.3, CONS-11). 64 символа — под hex SHA-256.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПовторитьПосле</Name>
					<Comment>Момент следующей попытки при временном техсбое (сеть, таймаут, 429/5xx); пусто — повтор не запланирован (§3.5). Читает и пишет ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТекущийЭтап</Name>
					<Comment>PLAN-01: название текущего этапа плана (заголовок пункта) — для быстрого отображения без join (план §5.1). Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.ТекущийПункт (PLAN-02, пока не реализован). Полный план не хранится в регистре — восстанавливается из последнего события PlanUpdated в ar_СобытияЗапуска. Пусто для запусков без плана.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповВсего</Name>
					<Comment>PLAN-01: общее количество этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповЗакрыто</Name>
					<Comment>PLAN-01: количество завершённых этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжидаетСобытия</Name>
					<Comment>PLAN-10: JSON-строка вида {\"object_type\": \"Справочник.Контрагенты\", \"filter\": {\"Наименование\": \"ООО Ромашка\"}} - тип объекта + плоский фильтр без операторов, по аналогии с ar_ОбработчикПодписок.ГорячиеТипы/ПроверитьФильтр. Заполняется ar_RuntimeЦикл/ar_ИнструментыПлан при вызове tool wait_for_event(object_type, filter, deadline_hours) (PLAN-11, пока не реализован). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжиданиеДо</Name>
					<Comment>PLAN-10: дедлайн ожидания события, DateTime (точность до секунды - deadline_hours в часах, PLAN-11). Заполняется ar_RuntimeЦикл при вызове tool wait_for_event как ТекущаяДата() + deadline_hours часов (PLAN-11, пока не реализован). Сравнивается с ТекущаяДата() в регламентном задании проверки дедлайна (PLAN-13). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Диалог</Name>					<Type>
						<v8:Type>cfg:CatalogRef.ar_Диалоги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Предмет</Name>					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_ИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ar_ОчередьApproval.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_ОчередьApproval</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_RunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Sequence</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ActionPayloadJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОбоснованиеLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СозданоВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РешеноВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РешилПользователь</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_IdempotencyKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтветитьДо</Name>					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_ApprovalId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ar_КонсольДанные/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// AgentRunner для 1С
//
// Copyright (C) 2026 Samolet
//
// Лицензия: GNU GPLv3. Полный текст — в файле LICENSE в корне репозитория,
// также: https://www.gnu.org/licenses/gpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_КонсольДанные (CONS-03).
//
// Модуль-поставщик данных для будущей формы консоли агентов (CONS-04, не в
// объёме этой задачи) - сама форма здесь не пишется.
//
// Четыре обязанности:
//  1. СписокЗапусков       - список запусков одним запросом (ПЕРВЫЕ 200).
//  2. СводныеСчётчики      - агрегат по ar_Статус, отдельным запросом.
//  3. СчётчикОжидающихApproval - агрегат по ar_ОчередьApproval, группировка по ar_RunId (идентификатор запуска).
//  4. ЗдоровьеПланировщика - тонкая обёртка над ar_Планировщик.ДиагностикаПланировщика().
//  (см. также СрезПоАгентам - CONS-07, и ЗапускДоступенТекущемуПользователю -
//  CONS-13, проверка видимости одного запуска для формы карточки).
//
// ЯДРО БЕЗОПАСНОСТИ ЗАДАЧИ: фильтр по ответственному встроен ВНУТРИ модуля,
// в приватную процедуру ПрименитьФильтрПоОтветственному. Ни одна
// экспортная функция НЕ принимает параметр, отключающий или подменяющий
// фильтр (ПоказатьВсе/БезФильтра/Пользователь и т.п.) - единственный
// легальный способ увидеть все запуски - быть полноправным пользователем
// (Пользователи.ЭтоПолноправныйПользователь(), тот же приём, что и в
// ar_ИнструментыДиспетчер, см. обоснование там же: перебор ролей, назначенных
// напрямую объекту ПользователиИнформационнойБазы, не отразил бы фактически
// действующие в сеансе права).
// [Реф: БСП/Пользователи.ЭтоПолноправныйПользователь]
//
// "Свой" запуск определяется через профиль (CONS-01/02), а не напрямую через
// ar_АгентРеф.ar_Пользователь:
//  - ar_ПрофильЗапуска заполнен -> пользователь должен быть в ТЧ
//    ar_ПрофилиЗапуска.ar_Ответственные этого профиля (любая роль);
//  - ar_ПрофильЗапуска пуст -> пользователь должен быть равен ar_Агенты.ar_Пользователь
//    агента запуска (текущее поведение для агентов без профиля, CONS-02);
//  - ar_АгентРеф тоже пуст (запуск без агента, СтартоватьВФонеБезАгента,
//    UI-22) -> видимость по ar_ПользовательРеф самого запуска - единственная
//    привязка к человеку, которая есть у безагентного запуска.
//
// Множество доступных идентификаторов запуска вычисляется ДО основного запроса компактными
// вспомогательными запросами (доступные профили + доступные агенты) и
// переиспользуется списком, сводкой и approval-счётчиком - без повторного
// вызова ar_ПрофилиЗапуска.Ответственные в цикле по строкам (N+1) и без ИЛИ в
// секции ГДЕ одного запроса (BSL LS: LogicalOrInTheWhereSectionOfQuery) -
// вместо этого два текста запроса, объединённые ОБЪЕДИНИТЬ ВСЕ, как уже
// принято в проекте (ar_ПрофилиЗапуска.Ответственные/ПрофилиАгента).
//
// ar_СобытияЗапуска/ar_ДействияАгента/ar_МетрикиLLM не участвуют ни в одном
// запросе модуля (жёсткое ограничение задачи).
//
// Свойства модуля: Сервер, без вызова с клиента, Привилегированный = Ложь.
// Запрещено: Выполнить(), Вычислить(), УстановитьПривилегированныйРежим.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обязанность 1. Список запусков одним запросом (константное число обращений
// к БД, не зависящее от количества строк результата).
//
// Параметры:
//  Отбор - Структура - необязательные поля отбора (все - Неопределено по умолчанию):
//    * Режим       - Строка - "Работают" / "ТребуютВнимания" / "ЗаПериод" / Неопределено (все режимы).
//    * ПериодС     - Дата - начало периода отбора по ar_СтартовалВ. Применяется ВСЕГДА,
//      когда задан (не только при Режим = "ЗаПериод") - CONS-04, панель отбора
//      комбинирует период с любым быстрым режимом.
//    * ПериодПо    - Дата - конец периода отбора по ar_СтартовалВ (см. ПериодС).
//    * АгентРеф    - СправочникСсылка.ar_Агенты - фильтр по конкретному агенту.
//    * СтатусыРеф  - Массив из ПеречислениеСсылка.ar_СтатусЗапуска - множественный
//      фильтр по статусу (CONS-04, план §2.2). Пустой массив трактуется как
//      "условие не наложено" (не как "ничего не показывать").
//    * ПользовательРеф - СправочникСсылка.Пользователи - фильтр по ответственному
//      (ar_ПользовательРеф запуска) - CONS-04.
//    * Триггер     - Строка - точное совпадение с ar_Триггер (значения manual/
//      schedule/mention/subscription/http/dialog) - CONS-04.
//    * ТолькоСОшибками  - Булево - Истина ограничивает выборку статусом Failed - CONS-04.
//    * ТолькоАвтономные - Булево - Истина ограничивает выборку агентами с
//      ar_РежимАвтономии = Autonomous (JOIN на Справочник.ar_Агенты, уже
//      присутствующий в тексте запроса) - CONS-04.
//   Если параметр не передан - Неопределено, соответствующее условие не накладывается.
//
// Возвращаемое значение:
//  Массив из Структура - {
//    ИдентификаторЗапуска - Строка,
//    Статус              - ПеречислениеСсылка.ar_СтатусЗапуска,
//    АгентРеф            - СправочникСсылка.ar_Агенты,
//    ПредставлениеАгента - Строка,
//    ПользовательРеф     - СправочникСсылка.Пользователи,
//    ПредставлениеПользователя - Строка,
//    СтартовалВ          - Дата,
//    ЗавершенВ           - Дата,
//    Триггер             - Строка,
//    ШаговВсего          - Число,
//    ТокеновВход         - Число,
//    ТокеновВыход        - Число,
//    СтоимостьРуб        - Число,
//    ПоследнийПульс      - Дата,
//    РодительскийИдентификаторЗапуска - Строка,
//    ЕстьСнимок          - Булево - признак наличия ar_StateSnapshot (НЕ само значение)
//    ПопытокВозобновления - Число - CONS-09, счётчик повторов техсбоя (0..3).
//    ПовторитьПосле        - Дата  - CONS-09, момент следующей попытки повтора
//      техсбоя; пустая дата (не заполнено) - повтор не запланирован. Вместе с
//      ПопытокВозобновления и статусом Failed консоль строит текст «ожидает
//      повтора, попытка N из 3».
//    ТекущийЭтап   - Строка - PLAN-06, название текущего этапа плана
//      (ar_ТекущийЭтап, до 150 симв.). Пусто - план не объявлен.
//    ЭтаповВсего   - Число  - PLAN-06, общее количество этапов плана
//      (ar_ЭтаповВсего). 0 - план не объявлен или запуск без планирования.
//    ЭтаповЗакрыто - Число  - PLAN-06, количество завершённых этапов плана
//      (ar_ЭтаповЗакрыто).
//  }, не более 200 строк, упорядочено по СтартовалВ УБЫВ.
//
Функция СписокЗапусков(Знач Отбор = Неопределено) Экспорт

	Если Отбор = Неопределено Тогда
		Отбор = Новый Структура;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 200
		|	Запуски.ar_ИдентификаторЗапуска КАК RunId,
		|	Запуски.ar_Статус КАК Статус,
		|	Запуски.ar_АгентРеф КАК АгентРеф,
		|	Агенты.Наименование КАК ПредставлениеАгента,
		|	Запуски.ar_ПользовательРеф КАК ПользовательРеф,
		|	Пользователи.Наименование КАК ПредставлениеПользователя,
		|	Запуски.ar_СтартовалВ КАК СтартовалВ,
		|	Запуски.ar_ЗавершенВ КАК ЗавершенВ,
		|	Запуски.ar_Триггер КАК Триггер,
		|	Запуски.ar_ШаговВсего КАК ШаговВсего,
		|	Запуски.ar_ТокеновВход КАК ТокеновВход,
		|	Запуски.ar_ТокеновВыход КАК ТокеновВыход,
		|	Запуски.ar_СтоимостьРуб КАК СтоимостьРуб,
		|	Запуски.ar_ПоследнийПульс КАК ПоследнийПульс,
		|	Запуски.ar_РодительскийИдентификаторЗапуска КАК РодительскийИдентификаторЗапуска,
		|	Запуски.ar_StateSnapshot ЕСТЬ НЕ NULL КАК ЕстьСнимок,
		|	Запуски.ar_ПопытокВозобновления КАК ПопытокВозобновления,
		|	Запуски.ar_ПовторитьПосле КАК ПовторитьПосле,
		|	Запуски.ar_ТекущийЭтап КАК ТекущийЭтап,
		|	Запуски.ar_ЭтаповВсего КАК ЭтаповВсего,
		|	Запуски.ar_ЭтаповЗакрыто КАК ЭтаповЗакрыто
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ar_Агенты КАК Агенты
		|		ПО Запуски.ar_АгентРеф = Агенты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО Запуски.ar_ПользовательРеф = Пользователи.Ссылка
		|ГДЕ
		|	ИСТИНА
		|	//ДОП_УСЛОВИЯ
		|УПОРЯДОЧИТЬ ПО
		|	Запуски.ar_СтартовалВ УБЫВ";

	ПрименитьФильтрПоОтветственному(Запрос);
	ДобавитьУсловияОтбора(Запрос, Отбор);

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура;
		Строка.Вставить("ИдентификаторЗапуска", СокрЛП(Выборка.RunId));
		Строка.Вставить("Статус", Выборка.Статус);
		Строка.Вставить("АгентРеф", Выборка.АгентРеф);
		Строка.Вставить("ПредставлениеАгента", СокрЛП(Строка(Выборка.ПредставлениеАгента)));
		Строка.Вставить("ПользовательРеф", Выборка.ПользовательРеф);
		Строка.Вставить("ПредставлениеПользователя", СокрЛП(Строка(Выборка.ПредставлениеПользователя)));
		Строка.Вставить("СтартовалВ", Выборка.СтартовалВ);
		Строка.Вставить("ЗавершенВ", Выборка.ЗавершенВ);
		Строка.Вставить("Триггер", СокрЛП(Выборка.Триггер));
		Строка.Вставить("ШаговВсего", Выборка.ШаговВсего);
		Строка.Вставить("ТокеновВход", Выборка.ТокеновВход);
		Строка.Вставить("ТокеновВыход", Выборка.ТокеновВыход);
		Строка.Вставить("СтоимостьРуб", Выборка.СтоимостьРуб);
		Строка.Вставить("ПоследнийПульс", Выборка.ПоследнийПульс);
		Строка.Вставить("РодительскийИдентификаторЗапуска", СокрЛП(Выборка.РодительскийИдентификаторЗапуска));
		Строка.Вставить("ЕстьСнимок", Выборка.ЕстьСнимок);
		Строка.Вставить("ПопытокВозобновления", Выборка.ПопытокВозобновления);
		Строка.Вставить("ПовторитьПосле", Выборка.ПовторитьПосле);
		Строка.Вставить("ТекущийЭтап", СокрЛП(Выборка.ТекущийЭтап));
		Строка.Вставить("ЭтаповВсего", Выборка.ЭтаповВсего);
		Строка.Вставить("ЭтаповЗакрыто", Выборка.ЭтаповЗакрыто);
		Результат.Добавить(Строка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Обязанность 3. Сводные счётчики по ar_Статус, отдельным агрегирующим
// запросом (НЕ подсчёт по результату функции списка запусков - тот
// ограничен ПЕРВЫЕ 200). Фильтр по ответственному идентичен фильтру списка
// (тот же приватный источник доступных идентификаторов запуска).
//
// Параметры:
//  Отбор - Структура - те же поля отбора, что принимает функция списка
//   запусков (Режим/ПериодС/ПериодПо/АгентРеф/СтатусыРеф/ПользовательРеф/
//   Триггер/ТолькоСОшибками/ТолькоАвтономные), чтобы сводка соответствовала
//   текущему режиму просмотра формы (CONS-04). "ТолькоАвтономные" требует
//   JOIN на Справочник.ar_Агенты - добавлен в текст запроса этой функции
//   специально для CONS-04 (изначально в СводныеСчётчики JOIN отсутствовал).
//
// Возвращаемое значение:
//  Массив из Структура - {Статус (ПеречислениеСсылка.ar_СтатусЗапуска), Количество (Число)}.
//
Функция СводныеСчётчики(Знач Отбор = Неопределено) Экспорт

	Если Отбор = Неопределено Тогда
		Отбор = Новый Структура;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Запуски.ar_Статус КАК Статус,
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ar_Агенты КАК Агенты
		|		ПО Запуски.ar_АгентРеф = Агенты.Ссылка
		|ГДЕ
		|	ИСТИНА
		|	//ДОП_УСЛОВИЯ
		|СГРУППИРОВАТЬ ПО
		|	Запуски.ar_Статус";

	ПрименитьФильтрПоОтветственному(Запрос);
	ДобавитьУсловияОтбора(Запрос, Отбор);

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура;
		Строка.Вставить("Статус", Выборка.Статус);
		Строка.Вставить("Количество", Выборка.Количество);
		Результат.Добавить(Строка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Обязанность 4. Счётчик ожидающих approval, агрегирующим запросом к
// ar_ОчередьApproval, группировка по ar_RunId (идентификатор запуска), ограничен статусом "pending".
// Видимость запуска - тот же фильтр по ответственному (соединение с
// ar_Запуски внутри этого же запроса - без отдельного прохода за списком
// идентификаторов запуска).
//
// Возвращаемое значение:
//  Массив из Структура - {ИдентификаторЗапуска (Строка), Количество (Число)}. Потребитель
//   считает и общий счётчик (сумма по всем строкам), и признак для
//   конкретной строки списка - из одного и того же результата.
//
Функция СчётчикОжидающихApproval() Экспорт

	// Левое соединение с ar_Запуски по ar_RunId - фильтр по ответственному
	// применяется к соединённой таблице Запуски (то же имя алиаса, что и в
	// ПрименитьФильтрПоОтветственному), без отдельного прохода по
	// ar_Запуски только за списком идентификаторов запуска (рекомендация спеки, «Обязанность 4»).
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Очередь.ar_RunId КАК RunId,
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	РегистрСведений.ar_ОчередьApproval КАК Очередь
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ar_Запуски КАК Запуски
		|		ПО Очередь.ar_RunId = Запуски.ar_ИдентификаторЗапуска
		|ГДЕ
		|	Очередь.ar_Статус = ""pending""
		|	//ДОП_УСЛОВИЯ
		|СГРУППИРОВАТЬ ПО
		|	Очередь.ar_RunId";

	ПрименитьФильтрПоОтветственному(Запрос);

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура;
		Строка.Вставить("ИдентификаторЗапуска", СокрЛП(Выборка.RunId));
		Строка.Вставить("Количество", Выборка.Количество);
		Результат.Добавить(Строка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Обязанность 5. Здоровье регламентных заданий - тонкая обёртка над уже
// существующей функцией, без переписывания её логики.
//
// Возвращаемое значение:
//  Массив из Структура - см. ar_Планировщик.ДиагностикаПланировщика().
//
Функция ЗдоровьеПланировщика() Экспорт

	Возврат ar_Планировщик.ДиагностикаПланировщика();

КонецФункции

// Страница «Захваты и очередь» консоли (agentrunner-32). Регистр захватов
// читается через привилегированный фасад - как ar_Запуски у ядра (роли
// расширения право на регистр не выдают), поэтому здесь только тонкие
// обёртки над ar_AuditЗащищённыйРежим, без собственного поднятия привилегий
// (запрещено шапкой модуля).

// Таблица захватов (спека п.6): агент, предмет, запуск, захвачен, триггер,
// сбоев подряд, исключён, последняя причина.
//
// Параметры:
//  РежимОтбора - Строка - "captured" (только захваченные), "excluded"
//                (только исключённые), иначе все. По умолчанию "captured".
//
// Возвращаемое значение:
//  ТаблицаЗначений - см. ar_ПредметыАгентов.ЗахватыДляКонсоли.
//
Функция ЗахватыПредметов(Знач РежимОтбора = "captured") Экспорт

	Возврат ar_AuditЗащищённыйРежим.ЗахватыДляКонсолиПривилегированно(РежимОтбора);

КонецФункции

// Агенты очереди со слотами и последним тиком диспетчера (спека п.6):
// агент, пакет, слотов занято/всего, последний queue_tick (момент, текст).
//
// Возвращаемое значение:
//  ТаблицаЗначений - Агент, ПакетИсточник, ЛимитЗапусков, ЗанятоСлотов,
//  ПоследнийТикМомент, ПоследнийТикТекст.
//
Функция ОчередьАгентов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Агенты.Ссылка КАК Агент,
		|	Агенты.ar_ПакетИсточник КАК ПакетИсточник,
		|	Агенты.ar_МаксПараллельныхЗапусков КАК МаксПараллельныхЗапусков
		|ИЗ
		|	Справочник.ar_Агенты КАК Агенты
		|ГДЕ
		|	Агенты.ar_Активен
		|	И Агенты.ar_БратьИзОчередиПакета
		|	И Агенты.ar_ПакетИсточник <> """"";

	ТаблицаОчереди = Новый ТаблицаЗначений;
	ТаблицаОчереди.Колонки.Добавить("Агент", Новый ОписаниеТипов("СправочникСсылка.ar_Агенты"));
	ТаблицаОчереди.Колонки.Добавить("ПакетИсточник", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаОчереди.Колонки.Добавить("ЛимитЗапусков", Новый ОписаниеТипов("Число"));
	ТаблицаОчереди.Колонки.Добавить("ЗанятоСлотов", Новый ОписаниеТипов("Число"));
	ТаблицаОчереди.Колонки.Добавить("ПоследнийТикМомент", Новый ОписаниеТипов("Дата"));
	ТаблицаОчереди.Колонки.Добавить("ПоследнийТикТекст", Новый ОписаниеТипов("Строка"));

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат ТаблицаОчереди;
	КонецЕсли;

	Агенты = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Агенты.Добавить(Выборка.Агент);
	КонецЦикла;

	ЗанятоСлотов = АктивныеЗапускиПоАгентам(Агенты);
	ПоследниеТики = ar_AuditЗащищённыйРежим.ПоследниеТикиОчередиПривилегированно(Агенты);

	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		Строка = ТаблицаОчереди.Добавить();
		Строка.Агент = Выборка.Агент;
		Строка.ПакетИсточник = СокрЛП(Выборка.ПакетИсточник);
		Строка.ЛимитЗапусков = ar_ПредметыАгентов.ЛимитЗапусковПоРеквизиту(Выборка.МаксПараллельныхЗапусков);
		СлотовАгента = ЗанятоСлотов.Получить(Выборка.Агент);
		Строка.ЗанятоСлотов = ?(СлотовАгента = Неопределено, 0, СлотовАгента);
		ДанныеТика = ПоследниеТики.Получить(Выборка.Агент);
		Если ДанныеТика <> Неопределено Тогда
			Строка.ПоследнийТикМомент = ДанныеТика.Момент;
			Строка.ПоследнийТикТекст = ДанныеТика.Текст;
		КонецЕсли;
	КонецЦикла;

	Возврат ТаблицаОчереди;

КонецФункции

// История событий механизма по предмету (спека п.6 «История по документу»):
// записи ar_СлужебныйЛог по навигационной ссылке предмета, по времени.
//
// Параметры:
//  Предмет - ОпределяемыйТип.ar_ПрикладнойОбъект.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Момент, Источник, Событие, Уровень, RunId, Текст.
//
Функция ИсторияПоПредмету(Знач Предмет) Экспорт

	Возврат ar_AuditЗащищённыйРежим.ИсторияПоПредметуПривилегированно(Предмет);

КонецФункции

// Команда консоли «Снять захват» (спека п.6; вызывается из формы под
// проверкой ТекущийПользовательМожетУправлять).
//
// Параметры:
//  СсылкАгент - СправочникСсылка.ar_Агенты.
//  Предмет    - ОпределяемыйТип.ar_ПрикладнойОбъект.
//
// Возвращаемое значение:
//  Булево - Истина, если операция применена.
//
Функция СнятьЗахват(Знач СсылкАгент, Знач Предмет) Экспорт

	Возврат ar_AuditЗащищённыйРежим.СнятьЗахватОператоромПривилегированно(СсылкАгент, Предмет);

КонецФункции

// Команда консоли «Сбросить сбои» (спека п.6; вызывается из формы под
// проверкой ТекущийПользовательМожетУправлять).
//
// Параметры:
//  СсылкАгент - СправочникСсылка.ar_Агенты.
//  Предмет    - ОпределяемыйТип.ar_ПрикладнойОбъект.
//
// Возвращаемое значение:
//  Булево - Истина, если счётчик был сброшен.
//
Функция СброситьСбои(Знач СсылкАгент, Знач Предмет) Экспорт

	Возврат ar_AuditЗащищённыйРежим.СброситьСбоиПредметаПривилегированно(СсылкАгент, Предмет);

КонецФункции

// Команда консоли «Снять отложение» (agentrunner-35; вызывается из формы под
// проверкой ТекущийПользовательМожетУправлять): предмет снова попадает в
// выдачу очереди, в журнале - subject_deferral_cleared.
//
// Параметры:
//  СсылкАгент - СправочникСсылка.ar_Агенты.
//  Предмет    - ОпределяемыйТип.ar_ПрикладнойОбъект.
//
// Возвращаемое значение:
//  Булево - Истина, если отметка отложения была и снята.
//
Функция СнятьОтложение(Знач СсылкАгент, Знач Предмет) Экспорт

	Возврат ar_AuditЗащищённыйРежим.СнятьОтложениеПривилегированно(СсылкАгент, Предмет, "operator");

КонецФункции

// CONS-13. Проверка видимости ОДНОГО конкретного запуска для
// текущего пользователя - используется формой ar_ПросмотрЗапуска перед показом
// карточки, открытой по прямому идентификатору запуска (минуя список, где фильтр уже
// применяется). Переиспользует то же ядро безопасности, что СписокЗапусков и
// СрезПоАгентам (ПрименитьФильтрПоОтветственному) - НЕ отдельная копия
// правил видимости. Параметра, отключающего проверку, у функции нет -
// единственный способ получить Истина без реального доступа - быть
// полноправным пользователем (см. заголовок модуля).
//
// Параметры:
//  ИдентификаторЗапуска - Строка - идентификатор запуска (ar_Запуски.ar_ИдентификаторЗапуска).
//
// Возвращаемое значение:
//  Булево - Истина, если запуск существует и виден текущему пользователю
//   (либо пользователь полноправный); Ложь, если запуска нет или он не входит
//   в множество доступных текущему пользователю.
//
Функция ЗапускДоступенТекущемуПользователю(Знач ИдентификаторЗапуска) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторЗапуска", ИдентификаторЗапуска);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Запуски.ar_ИдентификаторЗапуска КАК RunId
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_ИдентификаторЗапуска = &ИдентификаторЗапуска
		|	//ДОП_УСЛОВИЯ";

	ПрименитьФильтрПоОтветственному(Запрос);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

// Обязанность 6 (CONS-07). Срез по агентам за период - для вкладки "Агенты"
// консоли: по каждому видимому агенту режим автономии, признак активного
// cron-расписания, дата последнего запуска в периоде, доля успешных
// завершений, суммарная стоимость за период, число ожидающих approval.
//
// Список агентов НЕ строится напрямую по Справочник.ar_Агенты без учёта
// видимости - агент виден, только если полноправный пользователь ИЛИ агент
// привязан к текущему пользователю напрямую (ar_Пользователь) ИЛИ у агента
// есть хотя бы один запуск, видимый через ПрименитьФильтрПоОтветственному
// (за весь период истории - не ограничено ПериодС/ПериодПо, иначе агент без
// запусков в выбранном периоде "утекал" бы из списка, хотя п.4 спеки требует
// строку для него). ПериодС/ПериодПо ограничивают только сами агрегаты
// (ПоследнийЗапуск/ДоляУспешных/СуммарнаяСтоимость/ОжидаютПодтверждения), не
// видимость строки агента.
//
// Доля успешных считается от ТЕРМИНАЛЬНЫХ запусков периода (решение спеки,
// "Формула доли успешных", вариант 1): Completed / (Completed + Failed +
// Cancelled + Interrupted + MaxStepsReached + DeniedGlobally +
// FailedIncompatibleState). Running/Created/PausedFor* не входят ни в
// числитель, ни в знаменатель - агент не штрафуется за ещё не завершённые
// запуски. Агент без терминальных запусков в периоде -> ДоляУспешных = -1
// (сигнал "нет данных" для потребителя; форма показывает текст "нет данных",
// не "0%" - п.4 спеки, D6).
//
// Параметры:
//  Отбор - Структура - необязательно, поля ПериодС/ПериодПо (Дата,
//   применяются к ar_СтартовалВ агрегатов). Остальные поля отбора первой
//   вкладки (АгентРеф/СтатусыРеф/Триггер и т.п.) сознательно не принимаются -
//   вкладка показывает все видимые агенты за период, а не подмножество
//   текущего фильтра списка запусков (см. спеку, "Новая функция").
//
// Возвращаемое значение:
//  Массив из Структура - {
//    АгентРеф            - СправочникСсылка.ar_Агенты,
//    ПредставлениеАгента - Строка,
//    РежимАвтономии      - ПеречислениеСсылка.ar_РежимАвтономии,
//    Активен             - Булево,
//    ЕстьРасписание      - Булево - есть активная ar_Рутины с ar_ТипТриггера = "cron",
//    ПоследнийЗапуск     - Дата - MAX(ar_СтартовалВ) за период, пусто если запусков нет,
//    ВсегоЗапусков       - Число - все запуски периода (любой статус),
//    ТерминальныхЗапусков - Число - знаменатель доли успешных (см. выше),
//    УспешныхЗапусков    - Число - Completed за период,
//    ДоляУспешных        - Число - УспешныхЗапусков / ТерминальныхЗапусков, либо
//                          -1, если ТерминальныхЗапусков = 0 ("нет данных"),
//    СуммарнаяСтоимость  - Число - СУММА(ar_СтоимостьРуб) за период,
//    ОжидаютПодтверждения - Число - pending-записи ar_ОчередьApproval по запускам
//                          этого агента за период
//  }, упорядочено по ПредставлениеАгента.
//
Функция СрезПоАгентам(Знач Отбор = Неопределено) Экспорт

	Если Отбор = Неопределено Тогда
		Отбор = Новый Структура;
	КонецЕсли;

	ПериодС = Неопределено;
	ПериодПо = Неопределено;
	Отбор.Свойство("ПериодС", ПериодС);
	Отбор.Свойство("ПериодПо", ПериодПо);
	ЕстьПериод = ЗначениеЗаполнено(ПериодС) И ЗначениеЗаполнено(ПериодПо);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтатусCompleted", Перечисления.ar_СтатусЗапуска.Завершён);

	Терминальные = Новый Массив;
	Терминальные.Добавить(Перечисления.ar_СтатусЗапуска.Завершён);
	Терминальные.Добавить(Перечисления.ar_СтатусЗапуска.ОшибкаВыполнения);
	Терминальные.Добавить(Перечисления.ar_СтатусЗапуска.Отменён);
	Терминальные.Добавить(Перечисления.ar_СтатусЗапуска.Прерван);
	Терминальные.Добавить(Перечисления.ar_СтатусЗапуска.ДостигнутМаксимумШагов);
	Терминальные.Добавить(Перечисления.ar_СтатусЗапуска.ОтклонёнГлобально);
	Терминальные.Добавить(Перечисления.ar_СтатусЗапуска.ОшибкаНесовместимоеСостояние);
	Запрос.УстановитьПараметр("СтатусыТерминальные", Терминальные);

	Запрос.УстановитьПараметр("ТипТриггераCron", "cron");

	Запрос.Текст =
		"ВЫБРАТЬ
		|	Агенты.Ссылка КАК АгентРеф,
		|	Агенты.Наименование КАК ПредставлениеАгента,
		|	Агенты.ar_РежимАвтономии КАК РежимАвтономии,
		|	Агенты.ar_Активен КАК Активен,
		|	ВЫБОР КОГДА Рутины.Агент ЕСТЬ НЕ NULL ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЕстьРасписание,
		|	АгрегатыЗапусков.ПоследнийЗапуск КАК ПоследнийЗапуск,
		|	ЕСТЬNULL(АгрегатыЗапусков.ВсегоЗапусков, 0) КАК ВсегоЗапусков,
		|	ЕСТЬNULL(АгрегатыЗапусков.ТерминальныхЗапусков, 0) КАК ТерминальныхЗапусков,
		|	ЕСТЬNULL(АгрегатыЗапусков.УспешныхЗапусков, 0) КАК УспешныхЗапусков,
		|	ЕСТЬNULL(АгрегатыЗапусков.СуммарнаяСтоимость, 0) КАК СуммарнаяСтоимость,
		|	ЕСТЬNULL(АгрегатApproval.ОжидаютApproval, 0) КАК ОжидаютПодтверждения
		|ИЗ
		|	Справочник.ar_Агенты КАК Агенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВИДИМЫЕ_АГЕНТЫ) КАК ВидимыеАгенты
		|		ПО Агенты.Ссылка = ВидимыеАгенты.АгентРеф
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				РутиныВложенный.ar_Агент КАК Агент
		|			ИЗ
		|				Справочник.ar_Рутины КАК РутиныВложенный
		|			ГДЕ
		|				РутиныВложенный.ar_Активна
		|				И РутиныВложенный.ar_ТипТриггера = &ТипТриггераCron) КАК Рутины
		|		ПО Агенты.Ссылка = Рутины.Агент
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|			(ВЫБРАТЬ
		|				ЗапускиАгр.ar_АгентРеф КАК АгентРеф,
		|				МАКСИМУМ(ЗапускиАгр.ar_СтартовалВ) КАК ПоследнийЗапуск,
		|				КОЛИЧЕСТВО(*) КАК ВсегоЗапусков,
		|				СУММА(ВЫБОР КОГДА ЗапускиАгр.ar_Статус В (&СтатусыТерминальные) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ТерминальныхЗапусков,
		|				СУММА(ВЫБОР КОГДА ЗапускиАгр.ar_Статус = &СтатусCompleted ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК УспешныхЗапусков,
		|				СУММА(ЗапускиАгр.ar_СтоимостьРуб) КАК СуммарнаяСтоимость
		|			ИЗ
		|				РегистрСведений.ar_Запуски КАК ЗапускиАгр
		|			ГДЕ
		|				ЗапускиАгр.ar_АгентРеф <> ЗНАЧЕНИЕ(Справочник.ar_Агенты.ПустаяСсылка)
		|				//ДОП_УСЛОВИЯ_ПЕРИОД_АГР
		|			СГРУППИРОВАТЬ ПО
		|				ЗапускиАгр.ar_АгентРеф) КАК АгрегатыЗапусков
		|		ПО Агенты.Ссылка = АгрегатыЗапусков.АгентРеф
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|			(ВЫБРАТЬ
		|				ЗапускиApproval.ar_АгентРеф КАК АгентРеф,
		|				КОЛИЧЕСТВО(*) КАК ОжидаютApproval
		|			ИЗ
		|				РегистрСведений.ar_ОчередьApproval КАК Очередь
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ar_Запуски КАК ЗапускиApproval
		|				ПО Очередь.ar_RunId = ЗапускиApproval.ar_ИдентификаторЗапуска
		|			ГДЕ
		|				Очередь.ar_Статус = ""pending""
		|				И ЗапускиApproval.ar_АгентРеф <> ЗНАЧЕНИЕ(Справочник.ar_Агенты.ПустаяСсылка)
		|				//ДОП_УСЛОВИЯ_ПЕРИОД_APPR
		|			СГРУППИРОВАТЬ ПО
		|				ЗапускиApproval.ar_АгентРеф) КАК АгрегатApproval
		|		ПО Агенты.Ссылка = АгрегатApproval.АгентРеф
		|УПОРЯДОЧИТЬ ПО
		|	Агенты.Наименование";

	Если ЕстьПериод Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"//ДОП_УСЛОВИЯ_ПЕРИОД_АГР",
			"И ЗапускиАгр.ar_СтартовалВ МЕЖДУ &ПериодС И &ПериодПо
			|	//ДОП_УСЛОВИЯ_ПЕРИОД_АГР");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"//ДОП_УСЛОВИЯ_ПЕРИОД_APPR",
			"И ЗапускиApproval.ar_СтартовалВ МЕЖДУ &ПериодС И &ПериодПо
			|	//ДОП_УСЛОВИЯ_ПЕРИОД_APPR");
		Запрос.УстановитьПараметр("ПериодС", ПериодС);
		Запрос.УстановитьПараметр("ПериодПо", ПериодПо);
	КонецЕсли;

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ВИДИМЫЕ_АГЕНТЫ)", "(" + ТекстВидимыхАгентов() + ")");
	УстановитьПараметрыВидимыхАгентов(Запрос);

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Строка = Новый Структура;
		Строка.Вставить("АгентРеф", Выборка.АгентРеф);
		Строка.Вставить("ПредставлениеАгента", СокрЛП(Строка(Выборка.ПредставлениеАгента)));
		Строка.Вставить("РежимАвтономии", Выборка.РежимАвтономии);
		Строка.Вставить("Активен", Выборка.Активен);
		Строка.Вставить("ЕстьРасписание", Выборка.ЕстьРасписание);
		Строка.Вставить("ПоследнийЗапуск", Выборка.ПоследнийЗапуск);
		Строка.Вставить("ВсегоЗапусков", Выборка.ВсегоЗапусков);
		Строка.Вставить("ТерминальныхЗапусков", Выборка.ТерминальныхЗапусков);
		Строка.Вставить("УспешныхЗапусков", Выборка.УспешныхЗапусков);
		Строка.Вставить("СуммарнаяСтоимость", Выборка.СуммарнаяСтоимость);
		Строка.Вставить("ОжидаютПодтверждения", Выборка.ОжидаютПодтверждения);

		Если Выборка.ТерминальныхЗапусков > 0 Тогда
			Строка.Вставить("ДоляУспешных", Выборка.УспешныхЗапусков / Выборка.ТерминальныхЗапусков);
		Иначе
			Строка.Вставить("ДоляУспешных", -1);
		КонецЕсли;

		Результат.Добавить(Строка);

	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Ядро фильтра по ответственному (безопасность задачи, см. заголовок
// модуля). Добавляет условие видимости к тексту запроса, который уже
// содержит алиас "Запуски" на РегистрСведений.ar_Запуски (в секции ГДЕ или в
// левом соединении, см. СчётчикОжидающихApproval) и заканчивается на "ГДЕ
// |	ИСТИНА" - процедура дописывает "И Запуски.ar_ИдентификаторЗапуска В (&ДоступныеЗапуски)"
// либо не добавляет ничего (полноправный пользователь - без ограничения).
//
// Множество доступных идентификаторов запуска вычисляется предварительным компактным запросом
// (константное число обращений к БД, не растёт с числом строк результата
// внешнего запроса) - НЕ вызывает ar_ПрофилиЗапуска.Ответственные в цикле
// (N+1): ТЧ ar_Ответственные читается один раз для всех профилей сразу, где
// ar_Пользователь = ТекущийПользователь.
//
// Параметры:
//  Запрос - Запрос - объект запроса с алиасом "Запуски" на ar_Запуски и
//   текстом, заканчивающимся на "ГДЕ |	ИСТИНА" (плейсхолдер вместо
//   собственного условия - упрощает дозапись через "И").
//
// Активные запуски (Выполняется + ПриостановленДляСобытия - те же статусы,
// что в подсчёте слотов ядра) по списку агентов одним запросом.
//
// Параметры:
//  Агенты - Массив - ссылки ar_Агенты.
//
// Возвращаемое значение:
//  Соответствие - "Агент -> Число активных запусков".
//
Функция АктивныеЗапускиПоАгентам(Знач Агенты)

	Результат = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Запуски.ar_АгентРеф КАК Агент,
		|	КОЛИЧЕСТВО(*) КАК ПоАгенту
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_АгентРеф В (&Агенты)
		|	И Запуски.ar_Статус В (&СтатусВыполняется, &СтатусПриостановленДляСобытия)
		|СГРУППИРОВАТЬ ПО
		|	Запуски.ar_АгентРеф";
	Запрос.УстановитьПараметр("Агенты", Агенты);
	Запрос.УстановитьПараметр("СтатусВыполняется", Перечисления.ar_СтатусЗапуска.Выполняется);
	Запрос.УстановитьПараметр("СтатусПриостановленДляСобытия",
		Перечисления.ar_СтатусЗапуска.ПриостановленДляСобытия);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Агент, Выборка.ПоАгенту);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура ПрименитьФильтрПоОтветственному(Запрос)

	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;

	ТекущийПользователь = Пользователи.ТекущийПользователь();

	ЗапросДоступных = Новый Запрос;
	ЗапросДоступных.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	// Два текста запроса, объединённые ОБЪЕДИНИТЬ ВСЕ, вместо ИЛИ в секции
	// ГДЕ (BSL LS: LogicalOrInTheWhereSectionOfQuery) - конвенция уже принята
	// в проекте, см. ar_ПрофилиЗапуска.Ответственные/ПрофилиАгента.
	ЗапросДоступных.Текст =
		"ВЫБРАТЬ
		|	Запуски.ar_ИдентификаторЗапуска КАК RunId
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_ПрофильЗапуска <> ЗНАЧЕНИЕ(Справочник.ar_ПрофилиЗапуска.ПустаяСсылка)
		|	И Запуски.ar_ПрофильЗапуска В
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Ответственные.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.ar_ПрофилиЗапуска.ar_Ответственные КАК Ответственные
		|		ГДЕ
		|			Ответственные.ar_Пользователь = &ТекущийПользователь)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Запуски.ar_ИдентификаторЗапуска
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_ПрофильЗапуска = ЗНАЧЕНИЕ(Справочник.ar_ПрофилиЗапуска.ПустаяСсылка)
		|	И Запуски.ar_АгентРеф <> ЗНАЧЕНИЕ(Справочник.ar_Агенты.ПустаяСсылка)
		|	И Запуски.ar_АгентРеф В
		|		(ВЫБРАТЬ
		|			Агенты.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.ar_Агенты КАК Агенты
		|		ГДЕ
		|			Агенты.ar_Пользователь = &ТекущийПользователь)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Запуски.ar_ИдентификаторЗапуска
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_ПрофильЗапуска = ЗНАЧЕНИЕ(Справочник.ar_ПрофилиЗапуска.ПустаяСсылка)
		|	И Запуски.ar_АгентРеф = ЗНАЧЕНИЕ(Справочник.ar_Агенты.ПустаяСсылка)
		|	И Запуски.ar_ПользовательРеф = &ТекущийПользователь";

	ДоступныеЗапуски = Новый Массив;
	Выборка = ЗапросДоступных.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДоступныеЗапуски.Добавить(СокрЛП(Выборка.RunId));
	КонецЦикла;

	ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_ИдентификаторЗапуска В (&ДоступныеЗапуски)");
	Запрос.УстановитьПараметр("ДоступныеЗапуски", ДоступныеЗапуски);

КонецПроцедуры

// Уникальный текстовый маркер, вставляемый в текст запроса на месте будущих
// дополнительных условий (см. ВставитьДополнительноеУсловие). Нужен, чтобы
// УПОРЯДОЧИТЬ ПО / СГРУППИРОВАТЬ ПО присутствовали в тексте запроса сразу
// (BSL LS: SelectTopWithoutOrderBy требует видеть сортировку статически, а
// не дописанной конкатенацией после того, как линтер уже проверил текст).
//
// Возвращаемое значение:
//  Строка - текст-маркер, синтаксически нейтральный для языка запросов
//   (пустой комментарий), не влияющий на результат, если условия не добавлены.
//
Функция МаркерДополнительныхУсловий()

	Возврат "//ДОП_УСЛОВИЯ";

КонецФункции

// Вставляет дополнительное условие в текст запроса на место маркера
// (см. МаркерДополнительныхУсловий), оставляя маркер для последующих вставок
// (несколько условий добавляются последовательно, каждое - перед тем же
// маркером).
//
// Параметры:
//  Запрос  - Запрос - текст которого содержит МаркерДополнительныхУсловий().
//  Условие - Строка - текст условия (например, "И Запуски.ar_Статус = &СтатусРеф"),
//   без собственных значений - параметры устанавливаются вызывающим кодом
//   отдельно через УстановитьПараметр.
//
Процедура ВставитьДополнительноеУсловие(Запрос, Знач Условие)

	Маркер = МаркерДополнительныхУсловий();
	ЗаменаМаркера = Условие + "
		|	" + Маркер;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, Маркер, ЗаменаМаркера);

КонецПроцедуры

// Часть ДобавитьУсловияОтбора, вынесенная отдельно ради когнитивной сложности
// (BSL LS: CognitiveComplexity) - режим быстрого просмотра и период (CONS-04:
// период больше не привязан к Режим = "ЗаПериод", применяется всегда, когда
// задан, независимо от активного быстрого режима - панель отбора плана §2.2
// задаёт период отдельной группой, а не альтернативой быстрым режимам).
//
// Параметры:
//  Запрос - Запрос - см. ДобавитьУсловияОтбора.
//  Отбор  - Структура - см. ДобавитьУсловияОтбора (поля Режим/ПериодС/ПериодПо).
//
Процедура ДобавитьУсловияРежимаИПериода(Запрос, Знач Отбор)

	Режим = Неопределено;
	Если Отбор.Свойство("Режим") Тогда
		Режим = Отбор.Режим;
	КонецЕсли;

	// Независимые (не ИначеЕсли) проверки: значения Режима взаимоисключающие
	// сами по себе (это одна строка), поэтому ветвление не нужно - а
	// Неопределено/неизвестное значение естественным образом не совпадает ни
	// с одним из трёх литералов, и условие по режиму просто не накладывается.
	Если Режим = "Работают" Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_Статус В (&СтатусыРаботают)");
		СтатусыРаботают = Новый Массив;
		СтатусыРаботают.Добавить(Перечисления.ar_СтатусЗапуска.Выполняется);
		СтатусыРаботают.Добавить(Перечисления.ar_СтатусЗапуска.Создан);
		Запрос.УстановитьПараметр("СтатусыРаботают", СтатусыРаботают);
	КонецЕсли;

	Если Режим = "ТребуютВнимания" Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_Статус В (&СтатусыТребуютВнимания)");
		СтатусыТребуютВнимания = Новый Массив;
		СтатусыТребуютВнимания.Добавить(Перечисления.ar_СтатусЗапуска.ПриостановленДляПодтверждения);
		СтатусыТребуютВнимания.Добавить(Перечисления.ar_СтатусЗапуска.ПриостановленДляВвода);
		СтатусыТребуютВнимания.Добавить(Перечисления.ar_СтатусЗапуска.ОшибкаВыполнения);
		СтатусыТребуютВнимания.Добавить(Перечисления.ar_СтатусЗапуска.Прерван);
		СтатусыТребуютВнимания.Добавить(Перечисления.ar_СтатусЗапуска.ДостигнутМаксимумШагов);
		Запрос.УстановитьПараметр("СтатусыТребуютВнимания", СтатусыТребуютВнимания);
	КонецЕсли;

	ПериодС = Неопределено;
	ПериодПо = Неопределено;
	Отбор.Свойство("ПериодС", ПериодС);
	Отбор.Свойство("ПериодПо", ПериодПо);
	Если ЗначениеЗаполнено(ПериодС) И ЗначениеЗаполнено(ПериодПо) Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_СтартовалВ МЕЖДУ &ПериодС И &ПериодПо");
		Запрос.УстановитьПараметр("ПериодС", ПериодС);
		Запрос.УстановитьПараметр("ПериодПо", ПериодПо);
	КонецЕсли;

КонецПроцедуры

// Достраивает текст запроса дополнительными условиями отбора по структуре
// Отбор (см. СписокЗапусков/СводныеСчётчики). Только параметризованные
// условия через УстановитьПараметр - без Выполнить()/Вычислить() и без
// конкатенации пользовательского ввода в текст запроса.
//
// Параметры:
//  Запрос - Запрос - объект запроса после ПрименитьФильтрПоОтветственному
//   (алиас "Запуски" уже присутствует в тексте, а для ТолькоАвтономные -
//   также алиас "Агенты" на ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ar_Агенты); текст
//   запроса будет дополнен через "И <условие>" (без ИЛИ - режимы задаются
//   отдельными параметрами, каждый - самостоятельное И-условие).
//  Отбор - Структура - поля отбора, см. докстроку СписокЗапусков (Режим/
//   ПериодС/ПериодПо/АгентРеф/СтатусыРеф/ПользовательРеф/Триггер/
//   ТолькоСОшибками/ТолькоАвтономные).
//
Процедура ДобавитьУсловияОтбора(Запрос, Знач Отбор)

	ДобавитьУсловияРежимаИПериода(Запрос, Отбор);

	АгентРеф = Неопределено;
	Если Отбор.Свойство("АгентРеф", АгентРеф) И ЗначениеЗаполнено(АгентРеф) Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_АгентРеф = &АгентРеф");
		Запрос.УстановитьПараметр("АгентРеф", АгентРеф);
	КонецЕсли;

	// CONS-04: множественный выбор статуса (план §2.2) - СтатусыРеф вместо
	// одиночного СтатусРеф. Пустой массив = условие не наложено (не "ничего
	// не показывать") - потребитель отвечает за то, чтобы не передавать сюда
	// пустой массив, если хочет реально отфильтровать "ничего".
	СтатусыРеф = Неопределено;
	Если Отбор.Свойство("СтатусыРеф", СтатусыРеф) И ТипЗнч(СтатусыРеф) = Тип("Массив")
		И СтатусыРеф.Количество() > 0 Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_Статус В (&СтатусыРеф)");
		Запрос.УстановитьПараметр("СтатусыРеф", СтатусыРеф);
	КонецЕсли;

	// CONS-04: фильтр по ответственному пользователю (ar_ПользовательРеф
	// самого запуска - то же поле, что используют безагентные запуски в
	// ПрименитьФильтрПоОтветственному, здесь используется как обычное поле
	// отбора панели, а не как ядро безопасности).
	ПользовательРеф = Неопределено;
	Если Отбор.Свойство("ПользовательРеф", ПользовательРеф) И ЗначениеЗаполнено(ПользовательРеф) Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_ПользовательРеф = &ПользовательРеф");
		Запрос.УстановитьПараметр("ПользовательРеф", ПользовательРеф);
	КонецЕсли;

	// CONS-04: точное совпадение по триггеру (ar_Триггер - произвольная
	// строка, не перечисление; значения manual/schedule/mention/subscription/
	// http/dialog известны заранее, см. докстроку СписокЗапусков).
	Триггер = Неопределено;
	Если Отбор.Свойство("Триггер", Триггер) И ТипЗнч(Триггер) = Тип("Строка")
		И Не ПустаяСтрока(Триггер) Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_Триггер = &Триггер");
		Запрос.УстановитьПараметр("Триггер", Триггер);
	КонецЕсли;

	// CONS-04: "только с ошибками" - Failed конкретно, отдельно от режима
	// "ТребуютВнимания" (тот шире - включает и PausedForApproval/Interrupted/
	// MaxStepsReached, см. докстроку задачи "Расхождение").
	ТолькоСОшибками = Ложь;
	Если Отбор.Свойство("ТолькоСОшибками", ТолькоСОшибками) И ТолькоСОшибками = Истина Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Запуски.ar_Статус = &СтатусОшибка");
		Запрос.УстановитьПараметр("СтатусОшибка", Перечисления.ar_СтатусЗапуска.ОшибкаВыполнения);
	КонецЕсли;

	// CONS-04: "только автономные" - требует ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ar_Агенты
	// с алиасом "Агенты" в тексте запроса (присутствует и в СписокЗапусков, и
	// (после этой задачи) в СводныеСчётчики).
	ТолькоАвтономные = Ложь;
	Если Отбор.Свойство("ТолькоАвтономные", ТолькоАвтономные) И ТолькоАвтономные = Истина Тогда
		ВставитьДополнительноеУсловие(Запрос, "И Агенты.ar_РежимАвтономии = &РежимАвтономный");
		Запрос.УстановитьПараметр("РежимАвтономный", Перечисления.ar_РежимАвтономии.Автономный);
	КонецЕсли;

КонецПроцедуры

// CONS-07: текст вложенного запроса "видимые агенты" для СрезПоАгентам -
// то же ядро безопасности, что и ПрименитьФильтрПоОтветственному, но
// возвращает СправочникСсылка.ar_Агенты (не идентификатор запуска) и НЕ ограничен периодом
// (агент виден, если у него есть хотя бы один видимый запуск за весь
// период истории, либо он привязан к текущему пользователю напрямую) -
// иначе агент без запусков в выбранном периоде "утекал" бы из списка вкладки
// (п.4 спеки, D6).
//
// Полноправный пользователь видит всех агентов напрямую из Справочник.
// ar_Агенты, без требования наличия хотя бы одного запуска - на вкладке
// "Агенты" уместно видеть только что созданного активного агента, у которого
// ещё не было ни одного запуска.
//
// Возвращаемое значение:
//  Строка - текст подзапроса (без внешних скобок), одна колонка "АгентРеф".
//
Функция ТекстВидимыхАгентов()

	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат
			"ВЫБРАТЬ
			|	Агенты.Ссылка КАК АгентРеф
			|ИЗ
			|	Справочник.ar_Агенты КАК Агенты";
	КонецЕсли;

	// Тот же приём "два SELECT через ОБЪЕДИНИТЬ ВСЕ вместо ИЛИ в ГДЕ", что и в
	// ПрименитьФильтрПоОтветственному (BSL LS: LogicalOrInTheWhereSectionOfQuery).
	Возврат
		"ВЫБРАТЬ
		|	Агенты.Ссылка КАК АгентРеф
		|ИЗ
		|	Справочник.ar_Агенты КАК Агенты
		|ГДЕ
		|	Агенты.ar_Пользователь = &ТекущийПользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Профили.ar_Агент КАК АгентРеф
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ar_ПрофилиЗапуска КАК Профили
		|		ПО Запуски.ar_ПрофильЗапуска = Профили.Ссылка
		|ГДЕ
		|	Запуски.ar_ПрофильЗапуска <> ЗНАЧЕНИЕ(Справочник.ar_ПрофилиЗапуска.ПустаяСсылка)
		|	И Запуски.ar_ПрофильЗапуска В
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			Ответственные.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.ar_ПрофилиЗапуска.ar_Ответственные КАК Ответственные
		|		ГДЕ
		|			Ответственные.ar_Пользователь = &ТекущийПользователь)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Запуски.ar_АгентРеф
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_ПрофильЗапуска = ЗНАЧЕНИЕ(Справочник.ar_ПрофилиЗапуска.ПустаяСсылка)
		|	И Запуски.ar_АгентРеф <> ЗНАЧЕНИЕ(Справочник.ar_Агенты.ПустаяСсылка)
		|	И Запуски.ar_АгентРеф В
		|		(ВЫБРАТЬ
		|			Агенты.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.ar_Агенты КАК Агенты
		|		ГДЕ
		|			Агенты.ar_Пользователь = &ТекущийПользователь)";

КонецФункции

// Устанавливает параметр &ТекущийПользователь, использованный в
// ТекстВидимыхАгентов (не требуется для полноправного пользователя - ветка
// без параметра). Отдельная процедура, а не инлайн в СрезПоАгентам, ради
// симметрии с ТекстВидимыхАгентов и для единой точки, где параметр
// устанавливается ровно один раз.
//
// Параметры:
//  Запрос - Запрос - объект запроса, текст которого уже содержит подзапрос
//   ТекстВидимыхАгентов() (см. СрезПоАгентам).
//
Процедура УстановитьПараметрыВидимыхАгентов(Запрос)

	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;

	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());

КонецПроцедуры

#КонецОбласти
